      * Sample COBOL program

       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello-world.
       PROCEDURE DIVISION.
       DISPLAY "Hello, world!".
       STOP RUN.
